[
  {
    "title": "Bulgogi",
    "image": "http://localhost:9000/images/Beef-Bulgogi.jpeg",
    "ingredients": [
      "boneless rib eye steak: 1 1/2 pounds",
      "pear: 1 peeled and grated",
      "reduced sodium soy sauce: 1/4 cup",
      "brown sugar: 2 tablespoons",
      "toasted sesame oil: 2 tablespoons",
      "garlic minced: 3 cloves",
      "freshly grated ginger: 1tbsp",
      "gochujang: 1tbsp",
      "vegetable oil: 2tbsp",
      "green onions: 2 thinly sliced",
      "toasted sesame seeds: 1tbsp "
    ],
    "directions": "Wrap steak in plastic wrap, and place in the freezer for 30 minutes. Unwrap and slice across the grain into 1/4-inch thick slices. In a medium bowl, combine pear, soy sauce, brown sugar, sesame oil, garlic, ginger and gochujang. In a gallon size Ziploc bag, combine soy sauce mixture and steak; marinate for at least 2 hours to overnight, turning the bag occasionally. Heat 1 tablespoon vegetable oil in a cast iron grill pan over medium-high heat.* Working in batches, add steak to the grill pan in a single layer and cook, flipping once, until charred and cooked through, about 2-3 minutes per side. Repeat with remaining 1 tablespoon vegetable oil and steak. Serve immediately, garnished with green onions and sesame seeds, if desired.",
    "time": "3 hours",
    "id": "1"
  },
  {
    "title": "Adas Polo",
    "image": "http://localhost:9000/images/Adas-Polo.jpeg",
    "ingredients": [
      "lentils:1 cup",
      "ground beef: 200gr",
      "vegetable oil: 2tbsp",
      "onion: 1pc",
      "tumeric: 1tsp",
      "cinnamon: 1/2tsp",
      "salt: 1/2tsp",
      "saffron threads: 2 pinches",
      "raisins: 1 cup",
      "medjool dates pitted: 1 cup",
      "basmati rice: 2 cups",
      "salt: 1/2tsp",
      "vegetable oil: 1tsp"
    ],
    "directions": "Rinse lentils with cold water before boiling to remove any dust or debris. You can soak the lentils for one to two hours to speed up the cooking process. Wash the raisins and barberries and pat dry on kitchen paper. Cook on a stovetop, using 3 cups of water to 1 cup of lentils. Be sure to use a large enough saucepan as the lentils will double or triple in size. Bring to a boil, cover tightly, reduce heat and simmer until they are tender. For whole lentils, cook time is typically 15-20 minutes. Then set aside.In a large pan, heat the vegetable oil. Fry the onion until it’s golden. Add the ground beef and cook until it’s light brown. Add the salt, cinnamon, turmeric, and bloomed saffron. Stir until ground beef is cooked completely. Reduce the heat and add the raisins and dates and stir. Set aside. Pour 6 cups of water into a large nonstick pot and bring to a boil over high heat. Add rice into a pan filled with boiling water. After 6 to 8 minutes when it begins to rise to the top and the water comes back to a boil. Check the rice is cooked at the end by trying a grain. Break one grain in half. Rice should be soft on the outside but hard in the middle. Pour rice into the colander to drain; then set aside. Scoop one-third of the rice into the pot. Layer with one-third of the cooked lentils. Repeat until you're out of rice and lentils and shape it into a pyramid. Add 3 tablespoons of the bloomed saffron. Cover the pot and cook until rice begins to steam for 30 - 40 minutes. Transfer the rice to a serving dish. Serve with cooked ground beef mixture.",
    "time": "1.5 hours",
    "id": "2"
  },
  {
    "title": "Beef and Noodle Soup",
    "image": "http://localhost:9000/images/beefsoup.jpeg",
    "ingredients": [
      "beef with bones: 2 kg",
      "ginger, sliced: 2",
      "garlic: 1 bulb",
      "spring onion: 3",
      "star anise: 3",
      "bay leaves: 3",
      "Cinnamon stick: 1",
      "Black pepper: 1 tbsp",
      "Sugar: 1 tbsp",
      "Soy sauce: 3 tbsp",
      "Beef stock cube: 5g cube",
      "Dried rice noodles ( pre-soaked in water for 1 hour ): 100 g",
      "Coriander ( chopped ): to taste",
      "Bean sprouts blanched: to taste",
      "Fresh chilli ( sliced ): to taste",
      "Lime wedges: 2"
    ],
    "directions": "First blanch the beef to remove the impurities from the bones. Fill the large pot with water about 3 litre, bring it to boil and place the beef. Boil for 6-8 minutes then drain all the water out. Rinse the beef bones with cold running water. ( Water should be cover the beef bones. ). Place the beef back in the large pot, fill about 3 litre cold water. Add ginger, garlic, spring onions, cinnamon, star anise, bay leaves, soy sauce, sugar, beef stock cube and black pepper. Bring it to boil, once it start boiling, turn down the heat, close the lid and simmer with low-medium heat for 1.5 to 2 hours, until the beef is tender. Once the beef is tender, strain the beef, bones and herbs out from the broth. Discard the beef bones and herbs. Cut the meat into small bite size pieces and set it aside. To season the beef broth, make a taste test and add salt and black pepper powder. Keep it warm. (If the soup broth is too thick, you can add a bit more water according to your desire consistency). To Serve - Boil the pre-soaked rice noodles in the hot boiling water for 1-2 minutes until soften. ( Or boil according to the packet instructions. ) Then blanch the bean sprouts for few seconds. Place the noodles in the serving bowl pour the beef broth in. Topped with beef pieces, blanched bean spouts, chilli slices, chopped coriander and lime wedges.",
    "time": "2 hours",
    "id": "3"
  },
  {
    "title": "Fried Plantains",
    "image": "http://localhost:9000/images/Plantains.jpeg",
    "ingredients": [
      "3 Green Plantains: 3pcs",
      "Vinegar: 1 tablespoon(s)",
      "Salt: 1 tablespoon(s) ",
      "Garlic Powder: 1 teaspoon(s) ",
      "Vegetable Oil: 1 cup(s) ",
      "Plantain Press: 1 Tostonera",
      "Hot Water: 1 cup"
    ],
    "directions": "Heat Oil on medium high heat in a deep fryer or frying pan. Peel plantains and angle cut each one into 5 equal pieces.In a bowl add the hot water, vinegar, salt and set aside.Lightly brown the plantains in the oil (Approximately 5 min).Remove the plantains from the oil and flatten each plantain using the tostonera.Soak the flattened plantains in the hot water and carefully back in the oil for an additional 5 min.Remove plantains from oil and place them on a paper towel to remove the excess oil. Serve hot",
    "time": "30 min",
    "id": "4"
  },
  {
    "title": "Pupusas",
    "image": "http://localhost:9000/images/pupusas.jpg",
    "ingredients": [
      "masa harina: 4 cups",
      "salt: 1/2 teaspoon",
      "butter: 2 tbsp",
      "chicken bouillon: 1 cube",
      "refried beans: 1 can",
      "shredded mozzarella cheese: 1 cup"
    ],
    "directions": "Make Dough: Add masa harina (corn flour) and salt to a large mixing bowl. Add the warm water, little by little, mixing the dough with your hand. You may not need all of the water. You want the masa to be the consistency of a soft play dough. If the dough is too wet, mix in some more masa harina. If it’s too dry, add a little more water. Mix in butter and chicken bouillon, if using. Scoop into balls: Scoop the dough into large, golf-ball-size portions. You can scoop all of the dough into balls before continuing, or make 1 pupusa at a time. Be sure to keep the dough covered with a damp cloth as you work, to keep it from drying out. Flatten and add filling: Use the palms of your hands to pat the dough into a disc, about 4 inches in diameter. Scoop about half a tablespoon of the beans and place it in the center of the dough circle, followed by a pinch of shredded cheese.  Shape into disc: Gently bring the edges of the dough up and around the filling, pinching it closed into a ball. Gently pat the dough between your palms to form it into a disc again. Be gentle so you don’t have big cracks of filling come through, but if you do have some, its fine! They don’t need to be perfect. Cook: Heat a large un-greased skillet or pan over medium heat. Place pupusas on the hot pan and cook for about 2-4 minutes on each side. You will know the pupusas are ready to flip when the edges are set and the bottom is lightly golden.",
    "time": "45 minutes",
    "id": "5"
  },
  {
    "title": "Borshch",
    "image": "http://localhost:9000/images/borsh.jpg",
    "ingredients": [
      "extra virgin olive oil: 3 teaspoons",
      "bone-in beef shank: 1 1/4 pound",
      "beef broth: 8 cups",
      "beets: 4 large",
      "carrots: 1 pound",
      "russet potato: 1",
      "cabbage: 2 cups thinly sliced",
      "fresh dill: 3/4 cup",
      "red wine vinegar: 3 tbps",
      "sour cream: 1 cup"
    ],
    "directions": "Heat 2 teaspoons oil in a large, thick-bottomed pot on medium high heat. Add the shank slice or stew beef. Let the beef brown lightly on one side, then turn over. Add the chopped onions to the pot. Let the onions cook and soften, about 5 minutes. Pour 4 cups of the beef broth over the beef and onions in the pot. Bring to a boil. Lower the heat to a simmer. Cover and cook until the meat is falling-off-the-bone tender, about 1 hour and 30 minutes. Peel and chop the beets, carrots, and potatoes into 1/2-inch pieces. Toss the beets and carrots with a teaspoon or two of olive oil and spread them out in a single layer on a foil lined roasting pan. Roast in preheated oven for 15 minutes. Once the beef has cooked through until tender, remove from the pot, and take the pot off the heat. If you are using a beef shank, remove and discard any bone, connective tissue, and excess fat. Chop the meat into bite sized pieces. Return the pot to the stove and add the remaining broth, the carrots, beets, and potato. Add the chopped meat to the pot, the sliced cabbage, and a half cup of the fresh dill. Bring to a simmer, and cook for another 15 minutes or so, until the cabbage is cooked through. Add the vinegar and season to taste with salt and freshly ground black pepper. (I use about 2 teaspoons of salt and 1 teaspoon of pepper, but the amount you use will depend on how salty your beef broth is to begin with.) The soup is best made a day ahead. (The longer the soup sits, the more it will all turn the deep red color of beets.)",
    "time": "2.5 hours",
    "id": "6"
  },
  {
    "title": "Arepas",
    "image": "http://localhost:9000/images/arepa.jpg",
    "ingredients": [
      "warm water: 2 cups",
      "sea salt: 2 tsp",
      "areparina: 2 cups",
      "cooking oil: 1 tbsp"
    ],
    "directions": "Preheat oven to 350 degrees F (176 C). Set out a baking sheet and line with parchment paper. And to a large mixing bowl, add water and salt. Stir to combine and dissolve salt. A little at a time, add the areparina and stir with a whisk or your hands (our preferred method). You may work your way all the way up to two cups, although we typically have 1-2 Tbsp leftover. You’re looking for a dough that doesn’t easily stick to your hands, is moldable and moist, and can be rolled into a ball. Once you have that consistency, cover with a towel for 5 minutes. We did mix both white and yellow areparina as inspired by Teote (optional).  Uncover, grab a large handful of dough, and roll into a ball (as the recipe is written, our batch made 6 large arepas, but it could also make 8-10 smaller arepas).  Carefully press the ball between the palms of your hands to form into a roughly 1/2-inch thick disc (for thinner, crispier arepas, press closer to 1/4 inch). If it cracks a lot on the sides, your dough may need 1-2 (15-30 ml) more water. A little cracking is OK – just use your hands to close the cracks by gently patting along the edges (see photo). Once the arepas are formed, heat a large cast-iron or non-stick pan over medium-high heat. Once hot, add a little oil and swirl to coat. Then add arepas, giving them a little room in between so they don’t touch. Cook for 2-3 minutes or until deep golden brown (a few blackened spots are OK). You’re looking to form a crust. Then flip and cook for 2-3 minutes more or until the underside is also browned. Transfer to your parchment-lined baking sheet and bake for 15-18 minutes or until slightly puffed up and a little more golden brown in color. Some people like to slice into them immediately, but I find they can be a little doughy in the middle at that stage, so I prefer to let them cool for 5-10 minutes and serve while they’re warm but not piping hot.",
    "time": "30 minutes",
    "id": "7"
  }
]
